app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("created_at", "updated_at", "user_id", "content") VALUES('2010-06-28 18:06:23', '2010-06-28 18:06:23', 101, 'aoeu')
---
  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save

DELETE FROM "microposts" WHERE "id" = 302
---
  def destroy
    @micropost.destroy