app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "microposts" WHERE ("microposts".user_id = 101) ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT * FROM "users" LIMIT 1
SELECT count(*) AS count_all FROM "microposts" WHERE ("microposts".user_id = 101)

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("name", "encrypted_password", "salt", "created_at", "updated_at", "admin", "remember_token", "email") VALUES('aoeu', '7f9f74f6d03ddb0a620f5f0d31a076099fcc78715b2873b2e89e6c45db355655', 'ae9f2b405576492f0db3f4ecca339a34b3a412f2a99bcb3ab8619428edb3281b', '2010-07-02 17:08:40', '2010-07-02 17:08:40', 'f', NULL, 'aoeuaoeu@gmail.com')

  def index
    @title = "All users"
    @users = User.paginate(:page => params[:page])
---
SELECT * FROM "users" LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)